docs/api/cfd/cases/wave_excited_body/background/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }

libs            (waveModels);
application     overInterDyMFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         34;
deltaT          0.005;
writeControl    adjustable;
writeInterval   0.25;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable yes;
adjustTimeStep  yes;
maxCo           0.65;
maxAlphaCo      0.65;
maxDeltaT       0.05;
functions
{
    // NOTE: no sixDoFRigidBodyState FO — it refCasts the mesh to
    // dynamicMotionSolverFvMesh and FATALs under dynamicOversetFvMesh.
    // Heave comes from the sixDoF 'report on' log lines instead.
    waveGauges
    {
        type            interfaceHeight;
        libs            (fieldFunctionObjects);
        alpha           alpha.water;
        writeControl    timeStep;
        writeInterval   1;
        locations       ( (2 0.02 0.0) (8 0.02 0.0) (8.8 0.02 0.0) (9.6 0.02 0.0) (10.4 0.02 0.0) (11.2 0.02 0.0) (12 0.02 0.0) (18 0.02 0.0) );
    }
}
