docs/api/cfd/cases/wave_excited_body/background/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    oversetPatch    { type overset; }
    oversetBoundary { type overset; }
    inlet  { type waveVelocity; value uniform (0 0 0); }
    outlet { type waveVelocity; value uniform (0 0 0); }
    ground { type fixedValue; value uniform (0 0 0); }
    top    { type pressureInletOutletVelocity; value uniform (0 0 0); }
    sides  { type empty; }
    bodyFrontBack { type empty; }
    floatingObject { type movingWallVelocity; value uniform (0 0 0); }
}
