docs/api/cfd/cases/wave_excited_body/background/system/topoSetDict
FoamFile { version 2.0; format ascii; class dictionary; object topoSetDict; }

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  regionToCell;
        insidePoints ((1 0.02 0.05));
    }
    { name c1; type cellSet; action new; source cellToCell; set c0; }
    { name c1; type cellSet; action invert; }
);
